app/views/playlists/show.html.erb

<h3>Canciones</h3>
<%@playlist.playlistsongs.each do |s|%>
  <%x = Song.find(s.song_id)%>
  <%artista = Artist.find(x.artist_id).Nombre%>
---
SELECT "playlistsongs".* FROM "playlistsongs" WHERE "playlistsongs"."playlist_id" = ?  [["playlist_id", 12]]
SELECT "songs".* FROM "songs" WHERE "songs"."playlist_id" = ?  [["playlist_id", 10]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]